In [42]:
import pandas as pd

In [43]:
df =pd.read_csv('20.csv')
df

   Class  Marks
0   2010   87.0
1   2011   85.0
2   2012   89.0
3   2013   89.0
4   2014    NaN
5   2015   82.0
6   2010   87.0
7   2017   92.0
8   2018   93.0
9   2019   92.0

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Class   10 non-null     int64
 1   Marks   9 non-null      float64
dtypes: float64(1), int64(1)
memory usage: 288.0 bytes

In [45]:
df1 = df.dropna(inplace=True)

In [46]:
df1

In [47]:
df

   Class  Marks
0   2010   87.0
1   2011   85.0
2   2012   89.0
3   2013   89.0
5   2015   82.0
6   2010   87.0
7   2017   92.0
8   2018   93.0
9   2019   92.0

In [48]:
df.fillna(32323)

   Class  Marks
0   2010   87.0
1   2011   85.0
2   2012   89.0
3   2013   89.0
5   2015   82.0
6   2010   87.0
7   2017   92.0
8   2018   93.0
9   2019   92.0

In [49]:
df['Marks'].mean()

88.44444444444444

In [50]:
df['Marks'].median()

89.0

In [51]:
df['Marks'].mode()

0    87.0
1    89.0
2    92.0
Name: Marks, dtype: float64

In [52]:
df.fillna(df['Marks'].median(),inplace = True)

In [53]:
df

   Class  Marks
0   2010   87.0
1   2011   85.0
2   2012   89.0
3   2013   89.0
5   2015   82.0
6   2010   87.0
7   2017   92.0
8   2018   93.0
9   2019   92.0

In [55]:
df.duplicated()

0    False
1    False
2    False
3    False
5    False
6     True
7    False
8    False
9    False
dtype: bool

In [56]:
df.drop_duplicates()

   Class  Marks
0   2010   87.0
1   2011   85.0
2   2012   89.0
3   2013   89.0
5   2015   82.0
7   2017   92.0
8   2018   93.0
9   2019   92.0